# GetWebThicknessInHeightCenter Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionGeneralT..::..GetWebThicknessInHeightCenter Method
StructuralSectionGeneralT Class See Also
---
Returns thickness of web measured in the 0.5 * height,
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public double GetWebThicknessInHeightCenter()
```

Visual Basic
---
```text
Public Function GetWebThicknessInHeightCenter As Double
```

Visual C++
---
```text
public:
double GetWebThicknessInHeightCenter()
```

# See Also
StructuralSectionGeneralT Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace